; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 6025)
	(= (fuel plane1) 419)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 4)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at person1 city5)
	(at person2 city1)
	(at person3 city1)
	(at person4 city0)
	(at person5 city6)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 969)
	(= (distance city0 city2) 902)
	(= (distance city0 city3) 521)
	(= (distance city0 city4) 989)
	(= (distance city0 city5) 662)
	(= (distance city0 city6) 996)
	(= (distance city0 city7) 998)
	(= (distance city0 city8) 922)
	(= (distance city1 city0) 969)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 551)
	(= (distance city1 city3) 791)
	(= (distance city1 city4) 850)
	(= (distance city1 city5) 753)
	(= (distance city1 city6) 995)
	(= (distance city1 city7) 876)
	(= (distance city1 city8) 871)
	(= (distance city2 city0) 902)
	(= (distance city2 city1) 551)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 970)
	(= (distance city2 city4) 995)
	(= (distance city2 city5) 525)
	(= (distance city2 city6) 886)
	(= (distance city2 city7) 743)
	(= (distance city2 city8) 871)
	(= (distance city3 city0) 521)
	(= (distance city3 city1) 791)
	(= (distance city3 city2) 970)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 768)
	(= (distance city3 city5) 999)
	(= (distance city3 city6) 599)
	(= (distance city3 city7) 829)
	(= (distance city3 city8) 949)
	(= (distance city4 city0) 989)
	(= (distance city4 city1) 850)
	(= (distance city4 city2) 995)
	(= (distance city4 city3) 768)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 825)
	(= (distance city4 city6) 894)
	(= (distance city4 city7) 856)
	(= (distance city4 city8) 617)
	(= (distance city5 city0) 662)
	(= (distance city5 city1) 753)
	(= (distance city5 city2) 525)
	(= (distance city5 city3) 999)
	(= (distance city5 city4) 825)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 641)
	(= (distance city5 city7) 826)
	(= (distance city5 city8) 520)
	(= (distance city6 city0) 996)
	(= (distance city6 city1) 995)
	(= (distance city6 city2) 886)
	(= (distance city6 city3) 599)
	(= (distance city6 city4) 894)
	(= (distance city6 city5) 641)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 662)
	(= (distance city6 city8) 815)
	(= (distance city7 city0) 998)
	(= (distance city7 city1) 876)
	(= (distance city7 city2) 743)
	(= (distance city7 city3) 829)
	(= (distance city7 city4) 856)
	(= (distance city7 city5) 826)
	(= (distance city7 city6) 662)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 682)
	(= (distance city8 city0) 922)
	(= (distance city8 city1) 871)
	(= (distance city8 city2) 871)
	(= (distance city8 city3) 949)
	(= (distance city8 city4) 617)
	(= (distance city8 city5) 520)
	(= (distance city8 city6) 815)
	(= (distance city8 city7) 682)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city6)
	(at person2 city4)
	(at person3 city5)
	(at person4 city2)
	(at person5 city4)
	))

(:metric minimize (+ (* 3 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (refuel plane1 city2)
   changed: (fuel plane1) from 419 to 6025
   goals met: 0 of 5
2. (fly plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 0 to 1772, (fuel plane1) from 6025 to 4253
   goals met: 0 of 5
3. (board person5 plane1 city6)
   deleted: (at person5 city6)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 5
4. (fly plane1 city6 city1)
   deleted: (at plane1 city6)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 1772 to 3762, (fuel plane1) from 4253 to 2263
   goals met: 0 of 5
5. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 5
6. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 0 of 5
7. (fly plane1 city1 city6)
   deleted: (at plane1 city1)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 3762 to 5752, (fuel plane1) from 2263 to 273
   goals met: 0 of 5
8. (refuel plane1 city6)
   changed: (fuel plane1) from 273 to 6025
   goals met: 0 of 5
9. (fly plane1 city6 city4)
   deleted: (at plane1 city6)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 5752 to 7540, (fuel plane1) from 6025 to 4237
   goals met: 0 of 5
10. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 3 to 2
   goals met: 1 of 5
11. (debark person5 plane1 city4)
   deleted: (in person5 plane1)
   added: (at person5 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 5
12. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 7540 to 9190, (fuel plane1) from 4237 to 2587
   goals met: 2 of 5
13. (debark person3 plane1 city5)
   deleted: (in person3 plane1)
   added: (at person3 city5)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 5
14. (board person1 plane1 city5)
   deleted: (at person1 city5)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 5
15. (zoom plane1 city5 city6)
   deleted: (at plane1 city5)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 9190 to 11754, (fuel plane1) from 2587 to 23
   goals met: 3 of 5
16. (debark person1 plane1 city6)
   deleted: (in person1 plane1)
   added: (at person1 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 5
17. (refuel plane1 city6)
   changed: (fuel plane1) from 23 to 6025
   goals met: 4 of 5
18. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 11754 to 13746, (fuel plane1) from 6025 to 4033
   goals met: 4 of 5
19. (board person4 plane1 city0)
   deleted: (at person4 city0)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 5
20. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 13746 to 15550, (fuel plane1) from 4033 to 2229
   goals met: 4 of 5
21. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 5
